资金出借咨询与服务协议

本《资金出借咨询与服务协议》（简称“本协议”）由以下三方于${date!}在华创金服官网签署并履行。
甲 方（出借人）：${realNameA!}
华创金服网站用户名：${userNameA!}
身份证号：${userIdCradA!}

乙	方：  华艾投资发展（上海）有限公司
住所地： 上海市崇明县陈家镇瀛东村53号幢 213室（上海智慧岛数据产业园）
丙	方： 大连伟荣投资有限公司
住所地： 辽宁省大连市普兰店区丰荣街道东和社区
根据《中华人民共和国合同法》 及相关法律、法规的规定，三方遵循平等、自愿、互利和诚实信用原则，友好协商，就乙方为甲方提供投资咨询，财务规划、投资管理等服务，丙方为甲方提供借款人推荐、 风险管理及借后管理服务达成一致， 特签署本协议，以兹信守。
第一条	释义
在本协议文本中，除非上下文另有解释，下列词语具有以下含义：
1.1 出借人：指依照法律规定自主选择出借一定数量资金给他人的自然人或公司及其他组织等。
1.2 借款人：指有资金需求，经丙方筛选推荐给出借人并得到出借人一定数量出借资金的自然人或公司及其他组织等。
1.3 债权：指在出借人与借款人借贷关系存续期间出借人拥有的全部权益，债权以人民币计价。
1.4 工作日：指中华人民共和国法律规定的工作日（法定工作日）。
1.5 第三方支付机构：指根据《非金融机构支付服务管理办法》的规定，经中国人民银行批准取得《支付业务许可证》的独立第三方支付机构，执行本合同的第三方支付机构由乙方指定。

第二条	资金出借方式
甲方可以通过以下方式实现个人的出借需求：
甲方有权通过参与丙方提供的出借服务计划，对丙方推荐的借款人进行选择或不可撤销的授权并接受丙方为其推荐的借款人，决定是否提供资金；如果决定出借，须通过华创金服网络平台（www.weirongcf.cn）达成交易。甲方确认或不可撤销的授权丙方代甲方签署确认或生成等方式签署《借款协议》、《债权转让及受让协议》、《抵押合同》、《质押合同》（如有）或其他融资文件，并按照融资文件的约定及时付款给借款人及/ 或债权转让人。甲方受其本人或授权丙方签署确认的融资文件条款的约束，自甲方将出借款项划付至借款人及/或债权转让人或其指定方账户时，甲方与借款人之间建立借款法律关系。

第三条	甲方的权利与义务
3.1 甲方参考丙方推荐后拥有最终决定是否出借资金给丙方推荐的借款人的权利，对于借款人的选择甲方具有独立的决定权。
3.2 甲方对丙方提供的《债权转让及受让协议》 约定的债权及其相关内容有异议的，应当在收到《债权转让及受让协议》 之日起7个工作日内联系乙方经办客户经理，向丙方提出异议。
3.3 甲方承诺：如在收到《债权转让及受让协议》之日起7个工作日内，未向丙方提出异议，则视为甲方同意丙方提供的《债权转让及受让协议》，该《债权转让及受让协议》对甲方发生合同约束力。
3.4 甲方享有其所出借款项带来的利息收益。
3.5 对于丙方基于推荐出借的需要而提供给甲方的借款人的个人证件及其他相关信用信息，甲方确保仅用于出借参考，不向乙方、 丙方以外的任何第三方透露，甲方有义务为借款人的信用信息及乙方、丙方的业务内容进行保密。如果甲方擅自、不恰当地向他人透露借款人的信用信息或乙方、丙方的商业秘密，由此对借款人和乙方、丙方造成的损失，由甲方承担全部责任。
3.6 甲方保证其所用于出借的资金的来源合法，甲方是该资金的合法所有人。如果任何一方对甲方出借资金归属、合法性问题提出异议，由甲方负责解决。如果因甲方出借的资金来源问题造成借款人和乙方、丙方损失，甲方应承担全部责任。
3.7 甲方账号丢失、忘记密码、操作失误等相关重要信息时，须及时通知乙、丙方。因甲方未及时通知乙、丙方而导致自身受到损失，由甲方自行承担责任。
3.8 甲方须保证资金出借账户中有足够金额，如果甲方资金出借账户中没有足够款项导致划款失败， 则乙方和丙方有权解除本协议，并要求甲方承担违约责任。
3.9 甲方应妥善保管本协议，直至协议终止。协议有效期内，若出现损毁、丢失等情况，应及时通知乙方；协议到期后，甲方应将本协议交回乙方。
第四条 乙方的权利和义务
4.1 乙方应当按照本协议的规定，恪尽职守，以诚实、信用、谨慎、有效管理的原则为甲方进行服务。
4.2 乙方有义务全程协助甲方完成既有债权的转让手续，并收取相关的服务费用。
4.3 乙方须对甲方信息、资产情况及其他服务相关事务的情况和资料依法保密。
第五条	丙方的权利和义务
5.1 丙方确保其推荐的借款人真实存在，甲方出借后形成的债权债务关系真实存在，否则丙方承担因该债权债务关系不存在而对甲方造成的损失。
5.2 丙方确保向甲方推荐的借款人经过相应的审核。
5.3 丙方有义务协助甲方办理各项信息及合同等变更手续，并在确定的报告日向甲方寄送其资金出借情况报告。
5.4 在甲方与借款人借贷关系存续期间，借款人发生违约行为时，丙方须根据甲方的指示采取合法合理的措施协助甲方进行催收和追讨。
5.5 丙方为甲方提供资金出借相关服务，包括但不限于借款人推荐、出借促成、回款管理、 出借资金借后管理及必要的催收服务及定期提供资金出借情况报告服务。
5.6 丙方须对甲方基本信息、资产情况及其他服务相关事物的情况和资料依法保密。

第六条	资金出借与回款账户
甲方指定如下账户作为其资金出借与回款账户， 甲方须确保如账户为甲方名下合法有效的银行账户。

出借人：${realNameA!}
华创金服网站用户名：${userNameA!}
第七条	甲方出借资金的回收管理
7.1 根据甲方与借款人之间的借款协议及相关文件的规定，借款人有义务根据借款协议的约定对甲方定期还本付息。为便利、 统一地回收本息，甲方委托并授权乙方授权其合作的第三方支付机构代为划扣借款人每期偿还的本息，在第三方支付机构每期收款日后的3个工作日内或本协议约定的其他时间与甲方进行结算及转支付。
第八条  甲方回款风险的处置方式
8.1 丙方为平台所有出借人的共同利益考虑，有权自行或由合作的第三方向借款人收取费用（包括但不限于贷后信用管理费及/或保障计划专款）并存入专用账户，用于降低出借人出借损失风险。针对上述费用的使用规则由丙方指定、修改并公示。丙方制定、修改账户规则的行为不视为丙方对甲方的本金及/或收益作出了任何明示或默示的担保和保证。
8.2 为丙方平台所有资金提供方的共同利益考虑，丙方可以选择与第三方保险机构或担保公司进行合作，对借款人的履约责任进行承保。具体保险方案以丙方与保险公司签订的协议约定为准。甲方在此同意并不可撤销的授权丙方，在保险期间内，当发生约定的保险理赔情形时，丙方有权代甲方向保险公司提交保险理赔资料；同时，甲方同意保险公司可将理赔款项直接或间接地支付至甲方的回款银行账户或第三方支付机构账户。
第九条	甲方的债权转让
在封闭期内，丙方无义务为甲方推荐任何债权受让人，甲方可自行将债权转让给未经丙方推荐的其他债权受让人并及时通知丙方，协助丙方办理相关手续；
但在甲方有特殊需要时，可向丙方提出将自己当时持有的债权的全部或部分转让给第三方的需求，经丙方同意后为甲方寻找债权受让人，并协助办理转让手续。
9.1如甲方提出债权转让申请，甲方所购买的任何出借产品的预期年化收益率将按以下条款之一计算：
9.1.1如果甲方在出借之日起90日内（含，下同）提出债权转让申请，则预期年化收益率按本公司单季宝出借模式的收益率执行；
9.1.2如果甲方在出借之日起90日后、180日内提出债权转让申请，则预期年化收益率按本公司单季宝出借模式的收益率执行；
9.1.3如果甲方在出借之日起180日后、365日内提出债权转让申请，则预期年化收益率按本公司华艾宝出借模式的收益率执行；
9.1.4如果甲方在出借之日起365日后提出债权转让申请，则预期年化收益率按本公司安心宝出借模式的收益率执行。
9.2丙方在接受甲方提出债权转让申请后，将努力为甲方寻找债权受让人。在完成债权转让时，甲方将按以下条款之一支付丙方转让服务费：
9.2.1丙方为甲方做债权转让处理，30日内（含，下同）完成，则甲方向丙方支付出借本金+收益的 5%
作为转让服务费；
9.2.2丙方为甲方做债权转让处理，30日后、60日内完成，则甲方向丙方支付出借本金+收益的 2%作为转让服务费；
9.2.3丙方为甲方做债权转让处理，60日后、90日内完成，则甲方向丙方支付出借本金+收益的 1%作为转让服务费；
9.2.4丙方为甲方做债权转让处理，90日后完成，则丙方不收取甲方转让服务费。

第十条资金出借

10.1 人民币${tenderAmount!}元（大写人民币:${tenderAmountCn!} ）
10.2 借款利率为年利率${rate!}%(月利率=年利率/12；日利率=年利率/365)
10.3 双方约定的借款期限为${period!}

第十一条	出借款项的支付
11．1 委托划扣
甲方选择“委托划扣”形式进行出借款项的支付，即委托乙方通过第三方支付机构从甲方出借银行账户中直接划扣款项给债权转让人。
11.1.1 划扣账户
甲方授权乙方委托依法拥有经营资质的第三方支付机构从甲方出借平台账号中代为划转出借金额， 由乙方按时划转给债权转让人；
11.1.2对于在本协议有效期内甲方与借款人签订的借贷文件及本协议中所规定的任何由第三方支付机构划扣的款项，若出现由于乙方原因导致的划扣错误，则乙方应返还错误划扣款项并按照银行活期存款利率的
2倍支付甲方利息。
11.2 甲方不得违反本条有关委托划扣的规定，将出借资金直接支付给债权转让方，否则，甲方直接支付的资金不构成甲方在本协议项下的出借资金，甲方应自行承担相应损失，并赔偿由此给乙方和丙方造成的损失。
第十二条	资金出借及回收方式说明
12.1安心宝：
12.1.1 甲方根据丙方推荐受让单个或多个《借款协议》项下全部或部分债权后，甲方委托乙方指定第三方支付机构将按月代划转的借款人偿还的本息，参考丙方推荐通过债权让与的方式进行新一次的出借，款项由乙方代为划转给债权的转让人；如丙方未能成功推荐，则借款人偿还的本息将在应还款日后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行支付，由甲方自行支配。
12.1.2 甲方该笔资金出借满12个月之日，甲方将该笔资金对应的债权全部转让给乙方为甲方寻找到的债权受让人，由债权受让人在12个月期满后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行支付（或由乙方代划扣）。债权与实际转让金额之间的差额为甲方支付给乙方的转让服务费，由债权受让人在债权转让完成时直接支付给乙方。
12.1.3 如果乙方未能在甲方该笔资金出借满12个月之日为甲方寻找到债权受让人，则由乙方在甲方每月的本息回收日，向甲方支付相当于其当时持有的该笔资金对应的债权0.5%（不足月的情况下，按照月0.5%折算成日利率，按天数进行补偿）的金额作为对甲方的补偿，补偿至下述日期中的最早一日：
12.1.3.1 乙方为甲方寻找到债权受让人，甲方接受并将债权进行转让（转让对价为该笔债权当时的价值）
之日；
12.1.3.2 乙方为甲方寻找到债权受让人，甲方选择不进行转让之日；
12.1.3.3 甲方出借款对应的所有借款人的还款完成之日；
如果在上述补偿过程中的任何时候，乙方为甲方寻找到债权受让人，甲方选择不进行转让，则乙方不再支付补偿。
12.1.4 如果甲方在该笔资金出借满12个月之日（或之前）未以书面形式明确向乙方提出继续出借或债权转让的委托，则对于期限届满之后的债权处理，甲方授权乙方进行债权转让处理: 即将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，实际转让金额以及支付日期按照12.1.2的有关规定进行处理。 如果乙方未能在甲方该笔资金出借满12个月之日为甲方寻找到债权受让人，参考本协议12.1.3的规定进行处理。      12.2月月宝：
12.2.1 甲方根据丙方推荐受让单个或多个《借款协议》项下全部或部分债权后，由乙方按月代甲方划转的借款人偿还的本息，将当月收益回收（在应还款日后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行划转），由甲方自行支配；其余部分参考丙方推荐通过债权让与的方式进行新一次的出借，款项由乙方指定第三方支付机构代为划转给债权的转让方；如丙方未能成功推荐，则借款人偿还的本息将在应还款日后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行支付，由甲方自行支配。
12.2.2 甲方该笔资金出借满12个月之日，甲方将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，债权转让金额由债权受让人在12个月期满后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行支付（或由乙方代划扣）。债权与实际转让金额之间的差额为甲方支付给乙方的转让服务费， 由债权受让人在债权转让完成时代为支付给乙方。
12.2.3 如果乙方未能在甲方该笔资金出借满12个月之日为甲方寻找到债权受让人，则由乙方在甲方每月的本息回收日，向甲方支付相当于其当时持有的该笔资金对应的债权0.5%（不足月的情况下，按照月0.5% 折算成日利率，按天数进行补偿）的金额作为对甲方的补偿，补偿至下述日期中的最早一日：
12.2.3.1 乙方为甲方寻找到债权受让人，甲方接受并将债权进行转让（转让对价为该笔债权当时的价值）
之日；
12.2．3．2 乙方为甲方寻找到债权受让人，甲方选择不进行转让之日；
12.2.3.3 甲方出借款对应的所有借款人的还款完成之日；
如果在上述补偿过程中的任何时候，乙方为甲方寻找到债权受让人，甲方选择不进行转让，则乙方不再支付补偿。
12．2．4 如果甲方在该笔资金出借满 12个月之日（或之前）未以书面形式明确向乙方提出继续出借或债权转让的委托，则对于期限届满之后的债权处理，甲方授权乙方进行债权转让处理：即将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，实际转让金额以及支付日期按照 12.2.2的有关规定进行处理。如果乙方未能在甲方该笔资金出借满 12个月之日为甲方寻找到债权受让人，参考本协议 12.2.3的规定进行处理。
        12.3单季宝：
12.3.1 甲方根据丙方推荐受让单个或多个《借款协议》项下全部或部分债权后，在3个月内甲方委托乙方指定第三方支付机构将按月代划转的借款人偿还的本息参考丙方的推荐通过债权让与的方式进行新一次的出借，款项由乙方代为划转给债权的转让方。
12.3.2 甲方该笔资金出借满3个月之日，甲方将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，由债权受让人在3个月期满后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行支付（或由乙方代划扣）。债权与实际转让金额之间的差额为甲方支付给乙方的转让服务费，由债权受让人在债权转让完成时代为支付给乙方。
12.3.3 如果乙方未能在甲方该笔资金出借满3个月之日为甲方寻找到债权受让人，则由乙方在甲方每月的本息回收日，向甲方支付相当于其当时持有的该笔资金对应的债权0.5%（不足月的情况下，按照月0.5% 折算成日利率，按天数进行补偿）的金额作为对甲方的补偿，补偿至下述日期中的最早一日: 
12.3.3.1 乙方为甲方寻找到债权受让人，甲方接受并将债权进行转让（转让对价为该笔债权当时的价值）
之日；
12.3.3.2 乙方为甲方寻找到债权受让人，甲方选择不进行转让之日；
12.3.3.3 甲方出借款对应的所有借款人的还款完成之日；
如果在上述补偿过程中的任何时候，乙方为甲方寻找到债权受让人，甲方选择不进行转让，则乙方不再支付补偿。
12.3.4 如果甲方在该笔资金出借满3个月之日（或之前）未以书面形式明确向乙方提出继续出借或债权转让的委托，则对于期限届满之后的债权处理，甲方授权乙方进行债权转让处理：即将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，实际转让金额以及支付日期按照12.3.2的有关规定进行处理。 如果乙方未能在甲方该笔资金出借满3个月之日为甲方寻找到债权受让人，参考本协议12.3.3的规定进行处理。

12.4华艾宝：
12.4.1 甲方根据丙方推荐受让单个或多个 《借款协议》项下全部或部分债权后，在 6个月内甲方委托乙方指定第三方支付机构将按月代划转的借款人偿还的本息，参考丙方推荐通过债权让与的方式进行新一次的出借，款项由乙方代为划转给债权的转让方。
12.4.2 甲方该笔资金出借满6个月之日，甲方将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，由债权受让人在6个月期满后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行支付（或由乙方代划扣）。 债权与实际转让金额之间的差额为甲方支付给乙方的转让服务费，由债权受让人在债权转让完成时代为支付给乙方。
12.4.3 如果乙方未能在甲方该笔资金出借满6个月之日为甲方寻找到债权受让人，则由乙方在甲方每月的本息回收日，向甲方支付相当于其当时持有的该笔资金对应的债权0.5%（不足月的情况下，按照月 0.5% 折算成日利率，按天数进行补偿）的金额作为对甲方的补偿，补偿至下述日期中的最早一日：
12.4.3.1 乙方为甲方寻找到债权受让人，甲方接受并将债权进行转让（转让对价为该笔债权当时的价值）
之日；
12.4.3.2 乙方为甲方寻找到债权受让人，甲方选择不进行转让之日；
12.4.3.3 甲方出借款对应的所有借款人的还款完成之日；
如果在上述补偿过程中的任何时候，乙方为甲方寻找到债权受让人，甲方选择不进行转让，则乙方不再支付补偿。
12.4.4 如果甲方在该笔资金出借满6个月之日(或之前)未以书面形式明确向乙方提出继续出借或债权转让的委托，则对于期限届满之后的债权处理，甲方授权乙方进行债权转让处理：即将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，实际转让金额以及支付日期按照12.4.2的有关规定进行处理。如果乙方未能在甲方该笔资金出借满 6个月之日为甲方寻找到债权受让人，参考本协议12.4.3的规定进行处理。
12.5年聚宝：
12.5.1 甲方根据丙方推荐受让单个或多个《借款协议》项下全部或部分债权后，在 24个月内甲方委托乙方指定第三方支付机构将按月代划转的借款人偿还的本息，参考丙方推荐通过债权让与的方式进行新一次的出借，款项由乙方代为划转给债权的转让方。
12.5.2 甲方该笔资金出借满 24个月之日，甲方将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，由债权受让人在 24个月期满后的3个工作日内向甲方在本协议第六条中指定的资金回收专用账户进行支付（或由乙方代划扣）。债权与实际转让金额之间的差额为甲方支付给乙方的转让服务费，由债权受让人在债权转让完成时代为支付给乙方。
12.5.3 如果乙方未能在甲方该笔资金出借满 24个月之日为甲方寻找到债权受让人，则由乙方在甲方每月的本息回收日，向甲方支付相当于其当时持有的该笔资金对应的债权 0.5%（不足月的情况下，按照月 0.5% 折算成日利率，按天数进行补偿）的金额作为对甲方的补偿，补偿至下述日期中的最早一日：
12.5.3.1 乙方为甲方寻找到债权受让人，甲方接受并将债权进行转让（转让对价为该笔债权当时的价值）
之日；
12.5.3.2 乙方为甲方寻找到债权受让人，甲方选择不进行转让之日；
12.5.3.3 甲方出借款对应的所有借款人的还款完成之日；
如果在上述补偿过程中的任何时候，乙方为甲方寻找到债权受让人，甲方选择不进行转让，则乙方不再支付补偿。
12.5.4 如果甲方在该笔资金出借满 24个月之日（或之前）未以书面形式明确向乙方提出继续出借或债权转让的委托，则对于期限届满之后的债权处理，甲方授权乙方进行债权转让处理：即将该笔资金对应的债权全部转让给乙方为其寻找到的债权受让人，实际转让金额以及支付日期按照12.5.2的有关规定进行处理。如果乙方未能在甲方该笔资金出借满24个月之日为甲方寻找到债权受让人，参考本协议12.5.3的规定进行处理。
第十三条	风险提示
13.1 政策风险
因宏观政策、财政政策、货币政策、行业政策、地区发展政策等因素引起的风险。
13.2 借款人信用风险
当借款人短期或者长期丧失还款能力（包括但不限于借款人收入情况、财产状况发生变化、人身出现意外、发生疾病、死亡等情况），或者借款人的还款意愿发生变化时，甲方的出借资金可能无法按时回收，如果出现上述情况，则按照合同第八条进行风险处置。
13.3 资金流动性风险
甲方按照约定将资金出借给借款人使用，在借款人不主动提前还款的情况下，借款人将按照约定的期限分期偿还甲方的本金和利息，甲方的出借资金将分期回收，因此资金回收需要一定的周期。同时，按照本协议的约定，丙方将根据甲方实际需要以及其他对甲方有利的时机，努力帮助甲方寻找、向甲方推荐愿意受让甲方债权的第三方，但不能确保一定能够在甲方需求的时间协助甲方寻找到合适的债权受让人。
13.4 不可抗力

由于战争、动乱、自然灾害等不可抗力因素的出现而可能导致华创金服平台服务器出现宕机、数据丢失等问题，导致甲方资金（债权）损失的风险。

第十四条	税务处理
甲方在资金出借、转让过程产生的相关税费，由甲方自行向其主管税务机关申报、缴纳（但法律规定由乙方或丙方代扣、代缴的除外），乙方、丙方不负责相关事宜处理。
第十五条	违约责任
任何一方违反本协议的约定，使得本协议的全部或部分不能履行，均应承担违约责任，并赔偿对方因此遭受的损失；如多方违约，根据实际情况各自承担相应的责任。违约方应赔偿因其违约而给守约方造成的损失，包括合同履行后可以获得的利益，但不得超过违反合同一方订立合同时可以预见或应当预见的因违反合同可能造成的损失。

第十六条	争议的处理
本协议在履行过程中，如发生任何争执或纠纷，且协商不成的，三方约定向丙方住所地人民法院提起诉讼。

第十七条	终止协议条款
甲方提出转让债权的，需向乙方、丙方提交书面申请文件《债权转让申请》，乙方、丙方同意并完成债权转让且甲方支付完相关费用等后，本协议终止。
第十八条	通知与送达
乙方或丙方发给甲方的通知、报告或者其他书面文件，应以快递、电子邮件或者其他通讯形式发出，送至甲方在《华创金服官网》中预留的电子邮箱或通讯地址。如采用快递方式，上述文件或通知在投邮后第2日，即视为送达；如采用电子邮件方式，邮件进入甲方预留电子邮箱之日，即视为送达。甲方更换预留电子邮箱及通讯地址的，应当以书面形式告知乙方、丙方，否则以原地址为准。
第十九条	其他事项
19.1 丙方为甲方寻找到债权受让人，甲方同意债权受让人在支付债权转让金额时将服务费及账户管理费代为支付给乙方，并将扣除转让服务费及账户管理费后的款项支付至甲方在本协议第六条中指定的资金回款账户。甲方在收到债权转让金额之日起不再拥有被转让债权的任何权利，并不得再向乙方或丙方提出任何主张或要求，债权受让人从转让日起享有转让债权的所有权利，并承担相应义务。
19.2 如果甲方出现出借债权的继承或赠与，必须由有主张权利的继承人或受赠人向丙方出示经国家有权机关认证的继承或赠与权利归属证明文件，经乙方、丙方确认后方予以协助进行债权的转移，由此产生的相关税费，由主张权利的继承人或受赠人，向其主管税务机关申报，缴纳，乙方、丙方不负责相关事宜的处
理。
19.3 本协议有效期与甲方所选类别资金出借期限一致，如协议期满任何一方没有提出终止协议的要求，本协议自动延续1年，以此类推；在每次协议到期时，如果三方需要对本协议版本进行修订，则在任何一方提出请求时，由三方协商决定是否签署新版协议。
19.4 三方确认，本协议的签署、生效和履行以不违反中国的法律法规为前提。如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。
19.5 本协议一式叁份，甲、乙、丙方各保留一份，每份具有同等法律效力。
19.6 本协议由甲方签字，乙、丙方签字或盖章后，于文首所载日期生效。

甲方声明：
甲方确认，在签署本协议时，乙方和丙方就本协议的全部条款已向甲方进行了详细的说明和解释，在签署本协议前，甲方已仔细阅读了本协议及相关附件，对本协议的所有条款及相关附件的内容已经阅悉，均无异议，并对各方的合作关系、有关权利、义务和责任条款的法律含义达成充分的理解，对乙方和丙方所提示的风险有充分的了解和预期，甲方接受自主出借行为所产生的全部收益及风险。
甲方在审阅完毕本协议文本时，已阅读并自愿做出以下承诺：
“本人已经阅读本协议所有条款，充分了解并清楚知晓相应权利义务，愿意承担相关风险。”




甲 方（出借人）：${realNameA!}
华创金服网站用户名：${userNameA!}
身份证号：${userIdCradA!}


乙方：华艾投资发展（上海）有限公司	丙方：大连伟荣投资有限公司

盖章：                                     	      盖章： 


合同编号：${contractId!}

签订时间：${date!}